# ExportLineweightKey Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLineweightKey Members
ExportLineweightKey Class Constructors Methods Properties See Also
---
The ExportLineweightKey type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportLineweightKey()()()() | Constructs a new default ExportLineweightKey. |
| ExportLineweightKey(Int32) | Constructs a new default ExportLineweightKey using the original line weight as input. |
| ExportLineweightKey(ExportLineweightKey) | Constructs a new copy of the input ExportLineweightKey object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExportLineweightKey |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OriginalLineweight | The original line weight. |

# See Also
ExportLineweightKey Class
Autodesk.Revit.DB Namespace